<template>
	<view v-if="currentId === '1'" class="info">
		{{firstValue}}
	</view>
	<view v-else-if="currentId === '2'" class="info">{{secondValue}}</view>
	<view class="info" v-else>
		{{threeValue}}
	</view>
</template>

<script setup>
	import {
		ref
	} from 'vue';
	import {
		onLoad
	} from '@dcloudio/uni-app';
	const currentId = ref("1");
	onLoad((value) => {
		currentId.value = value.id
	})


	const firstValue = `
	用户已充分阅读、理解并同意接受本协议全部内容的约束，用户承诺接受并遵守本协议的约定，届时用户不应以未阅读本协议的内容等理由主张本协议无效，或要求撤销本协议。
	
	一、基本原则
	1.规范适用于所有用户。
	2.须遵纪守法，对他人保持友善和尊重。不得发表发送违背法律法规及社会公德的内容，用户需要对自己发表和发送的内容负责，平台有权删除不符合社区规范的内容。
	3.用户访问或使用我方产品，即视为同意接受本规范的全部内容。
	4.用户同意，对用户在平台上发表的全部内容，不可撤销的授予本平台不限时间和地域范围的非独家使用权。本平台有权在本平台各种形态的产品和服务上(包括但不限干网站微信公众以及发表的应用或其他互联网产品)对该内容讲行使用(包括但不限于根据情况对该内容进行署名或匿名转载以及对该内容讲行引用改编等二次创作)本平台引用，改编等二次创作所产生的新的作品的著作权属平台所有，未经平台事先书面同意，用户不得擅自进行使用平台和其他品牌合作的版权归属，以合同协议为准。
	5.本平台仅为用户发布的内容提供存储空间和发信服务，平台不对用户发表，转载的内容提供任何形式的保证:平台不保证网络服务一定能满足用户的要求，也不保证网络服务不会中断，对网络服务的及时性，安全性，准确性也都不作保证，对于因不可抗力或平台不能控制的原因造成的网络服务中断或其它缺陷，平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
	6.用户在本平台发表的内容(包含但不限于平台目前各产品功能里的内容)仅表明其个人的立场和观点，并不代表平台的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。平台不承担任何法律及连带责任。
	7.个人或单位如认为平台上存在侵犯自身合法权益的内容，应准备好具有法律效应的证明材料，及时与平台取得联系，以便平台迅速做出处理。
	8.本平台不保证发送短信的100%到达率，由运营商决定。附则对免责声明的解释、修改及更新权均属平台所有。
	
	二、信息规范
	平台可能采取删除违规内容、终止违规用户使用功能等方式，对以下违法、不良信息或存在危害的行为进行处理，也包括封禁用户账号，同样适用于提交发表公开信内容服务。
	发送违反法律法规：发布违反国家相关法律法规及管理规定的信息
	发送反对宪法所确定的基本原则的内容
	发送危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的内容
	发送损害国家荣誉和利益的内容
	发送煽动民族仇恨、民族歧视，破坏民族团结的内容
	发送侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的的内容
	发送破坏国家宗教政策，宣扬邪教和封建迷信的内容
	发送散布谣言，扰乱社会秩序，破坏社会稳定的内容
	发送宣扬淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的内容
	发送煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的内容
	发送诽谤他人，泄露他人隐私，侵害他人合法权益的内容
	发送含有法律、行政法规禁止的其他内容的信息的内容
	不友善行为，包括但不限于以下几点：
	发送人身攻击及辱骂他人的内容。
	发送针对以下群体发表诅咒、歧视、漠视生命尊严等性质的言论，群体包括：国籍、地域、性别、性别认同、性倾向、种族、疾病、宗教、残障群体等的内容。
	发送对他人进行诅咒、恐吓或威胁的内容。
	发送针对他人的私德、观点立场、素质、能力等方面的贬低或不尊重的内容。
	发送讽刺他人，阴阳怪气地表达批评的内容。
	发送对他人使用粗俗用语，并产生了冒犯的内容。
	发布垃圾广告信息：用户以推广曝光为目的，发布影响用户体验、扰乱社区秩序的内容，或进行相关行为，包括但不限于以下几点：
	多次发布包含售卖产品、提供服务、宣传推广内容的垃圾广告。
	使用严重影响用户体验的违规手段进行恶意营销。
	恶意行为：滥用产品功能，进行影响用户体验，危及平台安全及损害他人权益的行为。包括但不限于以下几点：
	重复发送干扰正常用户体验的内容。
	发送含有潜在危险的内容，或使用第三方网站伪造跳转链接，如钓鱼网站、木马、病毒网站等。
	发送微信、QQ、电话等联系方式。
	色情低俗信息，包括但不限于以下几点：
	包含自己或他人性经验的细节描述或露骨的感受描述
	涉及色情段子、两性笑话的低俗内容
	带有性暗示、性挑逗等易使人产生性联想
	展现血腥、惊悚、残忍等致人身心不适
	炒作绯闻、丑闻、劣迹等
	宣扬低俗、庸俗、媚俗内容
	不实信息，包括但不限于以下几点：
	可能存在事实性错误或者造谣等内容
	存在事实夸大、伪造虚假经历等误导他人的内容
	伪造身份、冒充他人，通过头像、用户名等个人信息暗示自己具有特定身份，或与特定机构或个人存在关联
	传播封建迷信，包括但不限于以下几点：
	宣扬鼓励封建迷信等活动，推广算命等理论
	其他危害行为或内容，包括但不限于以下几点：
	可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好影响未成年人身心健康的
	不当评述自然灾害、重大事故等灾难的
	美化、粉饰侵略战争行为的
	法律、行政法规禁止，或可能对网络生态造成不良影响的其他内容。
	
	三、违规行为处理流程
	平台通过主动发现和接受用户举报两种方式收集违规行为信息。用户可以向平台反馈涉嫌规范的的行为和用户。违规的信息由平台根据规范直接处理并永久封禁账号。
	侵权投诉：用户在平台发布的内容仅表明其个人的立场和观点，并不代表平台的立场和观点。如个人或企业发现平台上存在侵犯自身合法权益的内容，可以向平台进行投诉。为了保证问题能够及时有效地处理，平台将要求投诉人提交真实有效、完整清晰的证明材料，否则投诉将无法受理。
	实名声明：平台鼓励用户发送积极向上阳光的内容，共同营造更加和谐的社区环境。
	
	四、保密条款
	1.本协议所称保密信息(包括发送内容和手机号码)，是指一方（以下简称“接受方”）从对方（以下简称“披露方”）取得的、获知的、或因双方履行本协议而共同创造且具有不可分割性的商业秘密（包括财务秘密）、技术秘密、经营诀窍和（或）其他应予保密的信息和资料，无论上述信息和资料以何种形式或载于何种载体，无论披露方在披露时是否以口头、图像或书面等方式表明其具有保密性。
	2.本协议有效期内及其终止后，任何一方均不应向任何第三方披露、泄漏或提供保密信息。
	3.平台与您双方应采取适当措施妥善保存对方提供的保密信息，措施的审慎程度不少于其保护自身的保密信息时的审慎程度。双方仅能将保密信息用于与本协议项下的有关用途或目的。
	4.双方保证保密信息仅可在各自一方从事该业务的负责人和雇员范围内知悉。在双方上述人员知悉该保密信息前，应向其提示保密信息的保密性和应承担的义务，并以可证明的方式表明上述人员确实承担本协议项下的保密责任。
	5.如确有必要，接受方应按照保密信息披露方的指示将含有保密资料的所有文件或其他资料归还给披露方，或按其指示予以销毁。
	6.本条上述限制条款不适用于以下情况：
	a) 在接受本协议之时或之前，该保密信息已以合法方式属接受方所有；
	b) 保密信息在通知给接受方时，已经公开或能从公开领域获得；
	c) 保密信息是接受方从与其没有保密或不透露义务的第三方获得的；
	d) 在不违反本协议项约定责任的前提下，该保密信息已经公开或能从公开领域获得；
	e) 该保密信息是接受方或其关联或附属公司独立开发，而且未从通知方或其关联或附属公司获得的信息中获益；
	f) 接受方应法院或其它法律、行政管理部门要求披露的信息（通过口头提问、询问、要求资料或文件、传唤、民事或刑事调查或其他程序）因而透露保密信息，在该种情况发生时，接受方应立即向披露方发出通知，并作出必要说明。
	7.平台与您双方亦对本协议的具体内容负有保密责任。
	8.平台与您双方为了履行本协议而进行的沟通、通知、告知等文件传递或文件交换，应由双方妥善保存，不得用于不利于双方开展业务的目的。双方不得诋毁诽谤对方，亦不得在公开场合以攻击对方为目的发布不利于双方的言论。
	
	五、知识产权
	1.网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由平台或其他权利人依法拥有其知识产权。非经平台或其他权利人书面同意任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表网站程序或内容。
	2.未经平台同意，您不得擅自使用您或其关联公司的商标、名称以及平台相关商标及其标识。
	3.开发者独立开发的应用的知识产权归其该所有人所有；权利人同意授予平台及其关联公司在全球范围内享有免费的、永久性的、不可撤消的、非独家的、可转让、可分许可的许可，许可平台应用开发平台使用、调用、演示产品等。该许可不受双方合作终止以及本协议终止的影响。
	4.本协议项目合作涉及的系统、代码、数据、品牌等，均由双方各自依法拥有知识产权，未经权利拥有一方的书面同意，另一方不得擅自使用、修改、复制、公开传播、发行，否则，权利拥有一方有权立即终止本协议并要求对方赔偿全部损失（包括但不限于调查取证费用、公证费用、律师费等）。
	5.您不得将平台基于本项目合作提供的技术接口、源代码及算法等进行反向工程、反汇编、重构、反编译、翻译、修改、复制，或者在未经明确允许的情况下创作衍生作品。
	本协议如在履行过程中发生议，由双方协商解决:协商不成的，任何一方有权向广州仲裁委员会根据其届时有效的仲裁规则进行仲裁，仲裁裁决是终局性的，对双方均有约束力。
	
	六、隐私保护技术服务条款
	1.您使用本服务应当阅读并遵守《用户协议》及本服务条款。如遇《用户协议》与本服务条款不一致之处，优先适用本服务条款。无论是否实际阅读本协议，您通过网络页面点击确认本条款或实际使用隐私保护技术服务，均表示您与平台已就本条款达成一致并同意接受本条款的全部约定内容。
	2.号码隐私保护服务：指平台与基础电信运营商合作为用户提供的短信发送服务，基础运营商为用户提供一个虚拟号码（以下简称虚拟号码），用户在发送短信时使用的虚拟号码发送。
	3.用户发送的内容和接受的电话号码属于客户的隐私，平台不会披露给任何第三方。
	为了能使用本服务，按照中国法律的要求，用户需同意以下事项：依相关注册提示填写信息，并确保相关资料的真实性、有效性和合法性。若用户提供任何违法、不道德或不适合通过本平台发送的内容，或者有理由怀疑您的行为属于程序或恶意操作，本平台有权无须事先通知即可暂停或终止您使用服务，并拒绝您于现在和未来使用本服务之全部或任何部分。
	本平台无须对用户的任何注册或登记资料承担任何责任，包括但不限于鉴别、核实任何注册或登记资料的真实性、正确性、完整性、适用性及/或是否为最新资料的责任。
	用户在本平台所进行的所有活动均属于个人行为，应遵守中华人民共和国法律法规，遵守人民网相关管理制度，遵守本平台的管理条例。为了建立健康的网络交流环境，用户需遵守网络道德，注意网络礼仪，做到文明上网。请依法、据实发布信息，不得捏造事实、诬陷诽谤他人、泄露他人隐私。
	使用本平台服务视为知悉并同意：如由于用户公开自己或其他第三方（包括但不限于个人、法人、非法人组织）信息造成的相关责任，由用户自身承担。
	
	用户在本平台发送的一切内容仅代表用户个人观点，不视为本平台赞同其内容之观点或证明其内容的真实性。因用户在本平台发布内容所产生的纠纷由用户负责处理，产生的法律责任由用户承担，该责任包括但不限于给本平台及其他第三方（个人、法人及非法人组织）造成的直接或间接法律责任。
	
	在法律允许的范围内，本平台对上述内容予以免责。
	除非本协议另有其它明示规定，本平台增加或强化目前本服务的任何新功能，包括所推出的新产品，均受本使用协议之规范。
	`
	const secondValue = `
	时间邮递员（以下简称“我们”）深知个人信息（本政策所述“个人信息”或“个人敏感信息”所包含的内容出自于GB/T35273《个人信息安全规范》）对您而言的重要性，也感谢您对我们的信任，我们将按法律法规要求，采取相应安全保护措施，尽力保护您的个人信息安全可控。基于此，“时间邮递员”平台产品和服务提供者上海屹之森信息科技工作室制定本《隐私政策》。
	
	本政策主要向您阐述我们收集哪些信息、所收集信息的用途、您所享有的权利等，并申明了我们对保护个人隐私的承诺。我们未来可能根据信息处理情境的变化更新或修改本政策。请您在使用猿辅导提供的任何服务前知晓本政策和任何补充政策。
	
	本政策适用于“时间邮递员”平台产品及服务，包括“时间邮递员”微信公众号
	
	我们将恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、公开透明原则、确保安全原则、主体参与原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。在使用“时间邮递员”平台产品或服务前，请您务必仔细阅读并理解本政策全部内容。一旦您开始使用“时间邮递员”平台产品或服务，即表示您已充分理解并同意本政策。
	
	如您对本政策内容有任何疑问、意见或建议，请通过文末的方式与我们联系。
	本隐私政策将帮助您了解以下内容：
	一、个人信息定义及范围
	二、我们如何使用和收集您的个人信息
	三、我们如何使用Cookie和同类技术
	四、我们如何共享、转让、公开披露您的个人信息
	五、我们如何保护您的个人信息
	六、您的权利
	七、我们如何处理用户的个人信息
	八、您的个人信息如何在全球范围转移
	九、本隐私政策如何更新
	十、争议解决
	十一、如何联系我们
	
	本版发布日期：2023年4月4日
	生效日期：2023年4月4日
	
	一、个人信息定义及范围
	（一）个人信息：指以电子或者其他方式记录的能够单独或与其他信息结合，识别特定自然人身份或者反映特定自然人活动情况的信息。
	（二）个人敏感信息：包括身份证件号码、手机号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、学历信息、执教信息等个人信息等。
	（三）本隐私政策中涉及的个人信息及个人敏感信息主要包括：
	1.基本信息：手机号码；
	2.网络身份标识信息（系统账号（含第三方）、IP地址及与前述有关的密码）、昵称、头像；
	3.时间邮递员使用数据（浏览及点击记录、软件使用记录）。
	
	二、我们如何使用和收集您的个人信息
	我们会出于本政策所述的以下目的，收集和使用您的个人信息：
	1.帮助您成为“时间邮递员”的用户
	为使用“时间邮递员”平台，您需要首先成为“时间邮递员”的注册用户，以便我们为您提供服务，您需要提供注册、登录时间邮递员帐号使用的电话号码，用户可自行填写姓名或昵称、头像基本信息。
	2.向您提供产品或服务
	（1）用户体验改进计划
	上海屹之森信息科技工作室将基于您对“时间邮递员”使用数据，结合个人常用设备信息进行统计，来诊断系统问题，优化产品体验。我们会使用工具统计您在使用上海屹之森信息科技工作室产品过程中产生的数据信息，其中包含应用启动数，页面访问数，重点按钮点击数，设置项的配置属性。随着上海屹之森信息科技工作室产品的后续版本升级，我们统计的范围会有所改变，您登录使用上海屹之森信息科技工作室后续版本产品的行为将被视为您对届时相关改变的同意。
	（2）客服与售后
	我们的客服和售后功能会使用你的账号信息以为您提供咨询服务。
	当您与我们联系时，我们可能会保存您的通信或通话记录和内容或您留下的联系方式，以便帮助您解决问题，或记录相关问题的处理方案及结果。我们的客服会使用您的账号信息与您核验您的身份。您有可能会在与我们的客服人员沟通时，提供给出上述信息外的其他信息。
	（3）基础业务功能
	我们的基础业务功能包括：
	注册/登录：您在使用时间邮递员某些核心功能时，需要先完成注册和登录。注册和登录默认微信授权登录，必要时需要您提供手机号。
	信箱：平台代为向您和您指定号码传达信息，历史信息也呈可见状态。
	3.为您提供安全保护保障
	个人信息匿名化处理：在收集到您的个人信息后，我们将通过技术手段及时对数据进行匿名化处理。我们会将匿名化后的数据与可用于回复识别个人的信息分开存储，并保证在后续的个人信息处理中不重新识别个人。在不泄露您个人信息的前提下，上海屹之森信息科技工作室有权对匿名化处理后的用户数据库进行挖掘、分析和利用（包括商业性使用）。
	若我们对于您的个人信息用于除政策列明之外的目的、范围或与使用于数据收集不一致的传输方式时，我们将会通知您并取得您的同意。
	4.征得授权同意的例外
	根据相关法律法规规定及国家标准，以下情形中，我们可能会依法收集并使用您的个人信息无需征得您的同意：
	（1）与国家安全、国防安全直接相关的；
	（2）与公共安全、公共卫生、重大公共利益直接相关；
	（3）与犯罪侦查、起诉、审判和判决执行等直接相关的；
	（4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
	（5）所收集的个人信息是您自行向社会公众公开的；
	（6）从合法公开披露的信息中收集个人信息的，如：合法的新闻报道、政府信息公开等渠道；
	（7）根据您的要求签订和履行合同所必须的；
	（8）用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现或处置产品或服务的故障；
	（9）为新闻单位或学术研究机构基于新闻报道、公共利益开展统计或学术研究所必要等，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理，且数据接收方无法复原并重新识别个人信息的；
	（10）法律法规规定的其他情形。
	
	三、我们如何使用Cookie、clickstream、web和同类技术[烦请确认是否会使用这些技术？
	为使您获得更轻松的访问体验，您访问“时间邮递员”平台产品或服务时，我们可能会通过采用各种技术收集和存储您访问“时间邮递员”平台服务的相关数据，这样可以识别您的身份，帮您省去重复输入注册信息的步骤，或者帮助判断您的帐号安全状态。这些数据文件可能是Cookie、clickstream、web，以及您的浏览器或关联应用程序提供的其他本地存储（以下简称“Cookie”）。请您理解，我们的某些服务只能通过使用Cookie才可得到实现。如您的浏览器或浏览器附加服务允许。多数浏览器工具条中的“帮助”部分会告诉您怎样防止您的浏览器接受新的Cookie，怎样让您的浏览器在您收到一条新Cookie时通知您或者怎样彻底关闭Cookie。此外，您可以通过改变浏览器附加程序的设置，或通过访问提供商的网页，来关闭或删除浏览器附加程序使用的Flash
	Cookie及类似数据。您可以修改对Cookie的接受程度或者拒绝“时间邮递员”平台的Cookie，但拒绝“时间邮递员”平台的Cookie在某些情况下您可能无法使用依赖于Cookie的“时间邮递员”平台服务的部分功能。
	我们网站上还可能包含一些电子图像（包括“网络Beacon”可或“单像素GIF文件”），它可以帮助网站计算浏览网页的用户或访问某些Cookie，我们会通过网络Beacon收集您浏览网页活动的信息（您访问的页面地址、您先前访问的援引页面的位置、您的浏览环境以及显示设定）。
	
	四、我们如何共享、转让、公开披露您的个人信息
	（一）共享
	我们不会与除我们及我们的关联方以外的任何公司、组织和个人共享您的个人信息，但以下情况除外：
	在以下情形中，您可以向我们提出删除个人信息的请求：
	1.事先获得您明确的同意或授权；
	2.根据法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下对外提供；
	3.符合与您签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；
	4.应您要求为您处理您与他人的纠纷或争议；
	（二）转让
	我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
	1.事先获得您明确的同意或授权；
	2.根据法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供；
	3.符合与您签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；
	4.在涉及合并、收购、资产转让或类似的交易时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，否则,我们将要求该公司、组织重新向您征求授权同意。
	（三）公开披露
	我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会公开披露您的个人信息：
	1.根据您的需求，在您明确同意的披露方式下披露您所指定的个人信息；
	2根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可能会依据所要求的个人信息类型和披露方式公开披露您的个人信息。
	（四）共享、转让、公开披露个人信息时事先征得授权同意的例外
	以下情形中，我们共享、转让、公开披露您的信息无需事先征得您的授权同意：
	1.与国家安全、国防安全直接相关的；
	2.与公共安全、公共卫生、重大公共利益直接相关的；
	3.与犯罪侦查、起诉、审判和判决执行等直接相关的；
	4.出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
	5.您自行向社会公众公开的个人信息；
	6.从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
	对外共享、转让、公开披露您的个人信息，我们对此负责，并承担相应的法律责任。
	
	五、我们如何保护您的个人信息
	1.我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
	2.SSL（Secure Socket Layer）协议加密保护。当您从设备或浏览器向我们的服务器发送或收取信息时，我们确保使用安全套接层（SSL）和其他算法对其进行加密。
	3.我们会采取合理可行的措施，尽力避免收集和处理无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非法律有强制的留存要求，例如《中华人民共和国电子商务法》要求商品和服务信息、交易信息保存时间自交易完成之日起不少于三年。我们判断个人信息的存储期限主要参考以下标准并以其中较长者为准：
	1、完成与您相关的交易目的、维护相应交易及业务记录，以应对您可能的查询或投诉；
	2、保证我们为您提供服务的安全和质量；
	3、您是否同意更长的留存期间；
	4、是否存在保留期限的其他特别约定。
	在超出保留期间后，我们会根据适用法律的要求删除您的个人信息，或使其匿名化处理。
	4.您的个人信息全都被储存在安全的服务器上，并在受控设施中受到保护。我们依据重要性和敏感性对您的数据进行分类，并且保证您的个人信息具有最高的安全等级。我们保证通过访问这些信息来帮助向您提供产品和服务的员工具有严格的合同保密义务，如果未能履行这些义务，其将会受到纪律处分或被终止合作。同样，我们对以云为基础的数据存储设有专门的访问控制措施。总而言之，我们定期审查信息收集、储存和处理实践，包括物理安全措施，以防止任何未经授权的访问和使用。
	尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。您知悉并理解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括但不限于不将自己的账号密码等个人信息透露给他人。我们将对于个人数据的泄露，及时通知相关的监管机构，并在一些特别的环境下，通知数据主体相关的数据泄露事件，以满足适用的相关法律，包括您所在地的数据保护法规。
	我们不对有可能进入第三方网站的隐私政策的合法性负责，您应检查第三方网站的隐私政策并确定是否接受。
	5.在不幸发生个人信息安全事件后，我们将按照法律法规的要求并最迟不迟于30个自然日内向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范或降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。
	
	六、您的权利
	按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
	1.访问权
	您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：
	帐号信息——如果您希望访问或编辑您的帐号中的个人资料信息等，您可以通过访问-时间邮递员-个人中心执行此类操作。
	2.更正权
	当您发现我们处理的关于您的个人信息有错误时，您可以通过登录“时间邮递员”个人中心帐号资料栏进行修改。
	3.删除权
	在以下情形中，您可以向我们提出删除个人信息的要求：
	(1)如果我们处理个人信息的行为违反法律法规；
	(2)如果我们收集、使用您的个人信息，却未征得您的同意；
	(3)如果我们处理个人信息的行为违反了与您的约定；
	(4)如果您不再使用我们的产品或服务；
	(5)如果我们不再为您提供产品或服务；
	(6)若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
	当您被从我们的服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。
	4.撤回同意权
	您可以电话联系客服向我们提出撤回收集、使用个人信息的同意授权。撤回同意后，我们后续不会再处理您的个人信息。同时，我们会保障您拒绝接收基于您个人信息推送的商业广告的权利。在我们对外共享、转让、公开披露您的个人信息时，我们会像您提供撤回同意的通知。撤回同意不影响撤回前基于同意的您的个人信息处理。
	5.查询权
	您可以通过登录“时间邮递员”到个人中心进行查询。
	6.注销权
	若您有注销需求，可联系客服申请注销，注销后时间邮递员未结算的薪资不再结算，后期无法恢复。
	7.个人信息主体获取个人信息副本
	您有权通过发送邮件至 zaizai@88.com 反馈需执行此操作。
	8.约束信息系统自动决策
	在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。
	9.响应您的上述请求
	为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
	我们将在十五天内做出答复。
	对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
	
	七、我们如何处理用户的个人信息
	对于经用户同意而收集个人信息的情况，我们只会在受到法律允许、用户明确同意或者保护用户所必要的情况下使用或公开披露此信息。
	如果我们发现自己在获得可证实的用户信息被盗用的情况下收集了用户的个人信息，则会设法尽快删除相关数据。
	
	八、您的个人信息如何在全球范围转移
	我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内，我们不会将您的个人信息转移至境外。
	
	九、本隐私政策如何更新
	我们的隐私政策可能变更。
	本政策为《时间邮递员用户协议》的重要组成部分。我们保留不时更新或修改本政策的权利。如果该等修改造成您在本政策下权利的实质减少（即“重大变更”），我们会通过不同渠道向您发送变更通知，包括但不限于网站公示、私信通知等方式。
	若您不同意修改后的隐私政策，您有权并应立即停止使用时间邮递员的服务。如果您继续使用我们的服务，则视为您接受我们对本政策相关条款所做的修改。
	时间邮递员的所有服务均适用本政策。但某些服务有其特定的隐私政策，该等特定的隐私政策更具体地说明时间邮递员在该服务中如何处理您的信息。如本政策与特定服务的隐私政策有不一致之处，请以该特定隐私政策为准。
	本政策所指的重大变更包括但不限于：
	1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
	2.我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
	3.个人信息共享、转让或公开披露的主要对象发生变化；
	4.您参与个人信息处理方面的权利及其行使方式发生重大变化；
	5.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化；
	6.个人信息安全影响评估报告表明存在高风险时；
	7.我们还会将本政策的旧版本存档，供您查阅。
	
	在“时间邮递员”平台停止运营时，我们会及时停止继续收集个人信息，可能以注意送达或网站公告的形式通知您停止运营的情况，并对您的个人信息进行删除或匿名化处理。
	
	十、争议解决
	本用户协议及您与上海屹之森信息科技工作室的关系适用于中华人民共和国大陆地区法律，但不包括其冲突法规范。您和上海屹之森信息科技工作室同意服从上海屹之森信息科技工作室所在地法院的司法管辖。
	
	十一、如何联系我们
	我们已经配备个人信息保护专门负责人员，如果您对本隐私政策有任何疑问，或对于您的个人信息处理存在任何投诉、意见，可以通过邮件方式联系我们的隐私负责人，我们的邮箱是： 849041@qq.com
	如果您对我们的答复不满意，还可以向消费者权益保护部门投诉或者向有管辖权的法院提诉讼。
	
	上海屹之森信息科技工作室
	
	发布时间： 2023-04-01 00:00:00
	`;	
	const threeValue = `
	使用说明
	
	1、输入对方的手机号码、确保无误后再进行下一步。
	
	2、编辑你想给对方发送的内容，超出66个字，按2条或以上信息收费，字数有限，请不要额外超出字数。
	
	3、请选择你想何时发送的时间、我们会按照你选择的时间点发送
	
	4、请阅读并接受且勾选：我已阅读并接受《用户协议》、《隐私政策》
	
	5、点击发送后请耐心等待，我们会及时处理信息。
	
	6、最后还是要提一点：网络不是法外之地，请大家自觉遵守法律法规。所有短信都会经过人工审核，请勿发送欺诈、辱骂、色情等违规信息！若发现违规内容，我们会将违规用户的信息以及IP地址上报公安系统以及中央网信办违法和不良信息举报中心！
	`
</script>

<style scoped lang="scss">
	.info {
		word-break: break-all;
		white-space: pre-line;
		padding: 20rpx 20rpx 50rpx;
		font-size: 30rpx;
	}
</style>
